[
  {
    "question": "И так, вы на базе Союз. Ваши приключения начинаются! \n\nПервым делом было решено выяснить техническое состояние базы, а для этого нужен компьютер. Везде был тусклый свет, что означало, что база работает на резервном питании. Вы без труда нашли палубу откуда производилось управление всей базой. На полу лежал справочник Линуксойда, а в углу была серверная стойка с монитором и клавиатурой. Единственное устройство, которое каким-то чудом тут работало, видимо, у него было отдельное питание. Взяв в руки справочник, вы подошли к нему. Осознав, что это сервер под управлением Unix системой, решили выяснить в какой директории сейчас находитесь. Для этого можно использовать команду: pwd (от англ. print working directory). \n\nВводите команду: pwd",
    "command": "pwd",
    "image": "././img/pwd.png",
    "output": "(Вывод команды pwd)"
  },
  {
    "question": "Сервер выдал справку по команде pwd. Заглянув в справочник Линуксойда, вы нашли следующую информацию касательно дополнительных ключей:\n\n Команда pwd позволяет выводить текущий рабочий каталог в Linux системах. Дополнительные ключи -L и -P используются для работы с символическими ссылками. \n\nНе совсем понятно что это все значит, вы решили пока отложить это и выяснить какие файлы имеются в директории Документы. Поискав информацию в справочнике, выяснили, что для вывода применяется команда: ls (от англ. list). Так же у команды ls имеются дополнительные ключи:\n\n-l - Вывести содержимое с подробной информацией\n-a - Вывести список файлов включая скрытые файлы\n-lh - Вывести размеры файлов в удобном формате\n-R - Рекурсивный вывод содержимого подкаталогов\n-t - Сортировка по времени изменения\n-lS - Сортировка по размеру файлов\n-lr - Обратный порядок сортировки\n--help - Вывод справки по команде\n\nИтак. смотрим что имеется в директории Документы выполнив команду ls:",
    "command": "ls",
    "image": "././img/ls.png",
    "output": "(Вывод команды ls)"
  },
  {
    "question": "На ваше удивление, директория была пустой, но, вы решили посмотреть, может имеются скрытые файлы. Как уже выяснили выше, для этого используется команда ls с ключом -a. \n\nВводим команду ls -a:",
    "command": "ls -a",
    "image": "././img/ls_-a.png",
    "output": "(Вывод команды ls -a)"
  },
  {
    "question": "Действительно, директория была пустой. Что ж, посмотрим, что имеется в домашней директории пользователя подумали вы. Что бы посмотреть что имеется в домашней директории, выводим команду ls и указываем путь до нужной директории. В нашем случае это: /home/user. \n\nВводим команду ls /home/user:",
    "command": "ls /home/user",
    "image": "././img/ls_home.png",
    "output": "(Вывод команды ls /home/user)"
  },
  {
    "question": "Сервер выдал множество директорий среди которых вас заинтересовала директория с названием VideoCam. Вы решили перейти в эту директорию, для перемещения по директориям как выяснили из справочника Линуксойда, применяется команда cd, далее указывается путь до нужной директории. \nСначала выйдем на уровень выше, то есть, выйдем из директории Документы в которой находимся, для этого после команды cd, через пробел, пишем две точки: cd .. \n\nВводим команду cd .. :",
    "command": "cd ..",
    "image": "././img/cd.png",
    "output": "(Вывод команды cd ..)"
  },
  {
    "question": "Как указано в справочнике, в Unix системах крайне важен регистр. То есть: Name и name это два разных имени, будь-то это название директорий или файлов. Наконец, переходим к заинтересовавшую нас директорию выполнив команду cd и, указав имя директории, в которую планируется перейти: cd VideoCam. \n\nВводим команду cd VideoCam:",
    "command": "cd videocam",
    "image": "././img/cd_VideoCam.png",
    "output": "(Вывод команды cd VideoCam)"
  },
  {
    "question": "Итак, выведем уже знакомой нам командой содержимое директории с подробной информацией, применив ключ: -l. \n\nВводим команду ls -l:",
    "command": "ls -l",
    "image": "././img/ls_-l.png",
    "output": "(Вывод команды ls -l)"
  },
  {
    "question": "Странно, но и эта директория оказалась пустой. Но название натолкнуло вас на идею посмотреть запущенные процессы. Что бы это сделать, можно ввести команды top или htop. Как и любая команда в Linux, команды представляют собой маленькие программы, которые поставляются с системой. Первая команда точно должна сработать, а вот вторая, может и нет, если соответствующий пакет не был установлен, подумали вы. И ввели команду top. \n\nСреди множества запущенных процессов вы нашли знакомое название: motioneye. В памяти всплыло, что это опенсорсный проект для видео наблюдения. А файлы записи с камер хранятся по пути: /var/lib/motioneye/. Останавливаем top сочетанием клавиш: ctrl + c. и переходим в директорию выполнив уже знакомую команду.\n\nВводим команду cd /var/lib/motioneye:",
    "command": "cd /var/lib/motioneye",
    "image": "././img/cd_motioneye.png",
    "output": "(Вывод команды cd /var/lib/motioneye)"
  },
  {
    "question": "Смотрим содержимое директории, выполнив изученную ранее команду.\n\nВводим команду ls:",
    "command": "ls",
    "image": "././img/ls_motioneye.png",
    "output": "(Вывод команды ls)"
  },
  {
    "question": "В этой директории находилось множество других директорий с именами: Camera1, Camera2, Camera3 и так далее, больше сотни. И в каждой директории множество видео файлов. Это большой объем информации и при всем желании скопировать для последующего изучения у вас не выйдет. Да и устройства куда все это можно было бы скопировать нет. С собой только небольшая флешка с образом Kali Linux выданная при прохождении инструктажа. \n\nНемного поразмыслив, пришли к выводу что на данный момент необходимости в этом сервере нет, решено было его выключить. Так можно было бы сэкономить немного энергии, ведь не известно от какого источника он питался и сколько сможет еще проработать. Что бы его выключить вы нашли команду в справочнике: shutdown now. \n\nВводим команду и выключаем сервер shutdown now:",
    "command": "shutdown now",
    "image": "././img/shutdown.png",
    "output": "(Вывод команды shutdown now)"
  }
]
